testCases/Cavity/Galbraith/non-ideality-comparison/cavity_stoich_ideal/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue PO4 0
    volScalarFieldValue MG 0
    volScalarFieldValue NH4 0 
    volScalarFieldValue H2O 1
);

regions
(
    boxToCell
    {
        box (-1 -1 -1) (0.02 0.2 0.1);
        fieldValues
        (
            volScalarFieldValue PO4 3e-8
            volScalarFieldValue H2O 0.99999997
        );
    }

    boxToCell
    {
        box (0.03 -1 -1) (0.05 0.2 0.1);
        fieldValues
        (
            volScalarFieldValue NH4 8.7e-4
            volScalarFieldValue H2O 0.99913
        );
    }

    boxToCell
    {   
        box (0.06 -1 -1) (0.08 0.2 0.1);
        fieldValues
        (
            volScalarFieldValue MG 8.6e-5
            volScalarFieldValue H2O 0.999914
        );
    }
);


// ************************************************************************* //
